app/controllers/twonts_controller.rb

SELECT "twonts".* FROM "twonts"
---
  def index
    @twonts = Twont.all

INSERT INTO "twonts" ("twont", "created_at", "updated_at", "likes", "boosts") VALUES (?, ?, ?, ?, ?)  [["twont", "This is a new test!"], ["created_at", "2022-12-28 04:59:14.879040"], ["updated_at", "2022-12-28 04:59:14.879040"], ["likes", nil], ["boosts", nil]]
---
  def create
    @twont = Twont.new(twont_params)

    respond_to do |format|
      if @twont.save

UPDATE "twonts" SET "twont" = ?, "updated_at" = ? WHERE "twonts"."id" = ?  [["twont", "This is a new test!!!"], ["updated_at", "2022-12-28 05:45:33.533296"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @twont.update(twont_params)

DELETE FROM "twonts" WHERE "twonts"."id" = ?  [["id", 2]]
---
  def destroy
    @twont.destroy

SELECT "twonts".* FROM "twonts" WHERE "twonts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_twont
      @twont = Twont.find(params[:id])